In [1]:
import pandas as pd
import numpy as np

In [2]:
s= pd.Series([1,3,5,np.nan,6.8])

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df=pd.DataFrame(np.random.randn(6,4), index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.920986  1.293260 -2.117696  0.754047
2013-01-02 -0.875652  1.385732 -0.318258 -0.340707
2013-01-03 -0.313632 -1.528980 -2.202203 -0.419540
2013-01-04 -2.239197 -0.292401 -0.207523 -1.213594
2013-01-05 -0.285067 -0.205031 -0.221134 -0.364099
2013-01-06  0.556276  1.962413  0.331986 -0.381046

In [5]:
df2=pd.DataFrame({'A':1.,'B':pd.Timestamp('20131214'),'C': pd.Series(1,index=list(range(4)),dtype='float32')})
df2

     A          B    C
0  1.0 2013-12-14  1.0
1  1.0 2013-12-14  1.0
2  1.0 2013-12-14  1.0
3  1.0 2013-12-14  1.0

In [6]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.679710  0.435832 -0.789138 -0.327490
std    0.932312  1.324346  1.086404  0.627337
min   -2.239197 -1.528980 -2.202203 -1.213594
25%   -0.909652 -0.270559 -1.667836 -0.409916
50%   -0.594642  0.544115 -0.269696 -0.372572
75%   -0.292208  1.362614 -0.210926 -0.346555
max    0.556276  1.962413  0.331986  0.754047

In [7]:
df.sort_index(axis=1,ascending=True)

                   A         B         C         D
2013-01-01 -0.920986  1.293260 -2.117696  0.754047
2013-01-02 -0.875652  1.385732 -0.318258 -0.340707
2013-01-03 -0.313632 -1.528980 -2.202203 -0.419540
2013-01-04 -2.239197 -0.292401 -0.207523 -1.213594
2013-01-05 -0.285067 -0.205031 -0.221134 -0.364099
2013-01-06  0.556276  1.962413  0.331986 -0.381046

In [8]:
df.sort_values('A')

                   A         B         C         D
2013-01-04 -2.239197 -0.292401 -0.207523 -1.213594
2013-01-01 -0.920986  1.293260 -2.117696  0.754047
2013-01-02 -0.875652  1.385732 -0.318258 -0.340707
2013-01-03 -0.313632 -1.528980 -2.202203 -0.419540
2013-01-05 -0.285067 -0.205031 -0.221134 -0.364099
2013-01-06  0.556276  1.962413  0.331986 -0.381046

In [12]:
df['D'] = np.array([5]*len(df))

In [15]:
df['E']= np.array([6]*len(df))

In [17]:
df.loc[:,'E'] = np.arange((len(df)))

In [19]:
df2=df.copy()

In [20]:
df2[df2>0]=-df2
df2

                   A         B         C  D  E
2013-01-01 -0.920986 -1.293260 -2.117696 -5  0
2013-01-02 -0.875652 -1.385732 -0.318258 -5 -1
2013-01-03 -0.313632 -1.528980 -2.202203 -5 -2
2013-01-04 -2.239197 -0.292401 -0.207523 -5 -3
2013-01-05 -0.285067 -0.205031 -0.221134 -5 -4
2013-01-06 -0.556276 -1.962413 -0.331986 -5 -5

In [23]:
np.where(df['A']>0)

(array([5]),)

In [24]:
df1=df.reindex(index = dates[0:4], columns=list(df.columns)+['F'])

In [26]:
df1.loc[dates[0]:dates[1],'F']=2
df1

                   A         B         C  D  E    F
2013-01-01 -0.920986  1.293260 -2.117696  5  0  2.0
2013-01-02 -0.875652  1.385732 -0.318258  5  1  2.0
2013-01-03 -0.313632 -1.528980 -2.202203  5  2  NaN
2013-01-04 -2.239197 -0.292401 -0.207523  5  3  NaN

In [27]:
df1.dropna(how='any')

                   A         B         C  D  E    F
2013-01-01 -0.920986  1.293260 -2.117696  5  0  2.0
2013-01-02 -0.875652  1.385732 -0.318258  5  1  2.0

In [30]:
df1.fillna(value = df1['F'].dropna().mean())

                   A         B         C  D  E    F
2013-01-01 -0.920986  1.293260 -2.117696  5  0  2.0
2013-01-02 -0.875652  1.385732 -0.318258  5  1  2.0
2013-01-03 -0.313632 -1.528980 -2.202203  5  2  2.0
2013-01-04 -2.239197 -0.292401 -0.207523  5  3  2.0

In [32]:
pd.isnull(df1)

                A      B      C      D      E      F
2013-01-01  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [40]:
s=pd.Series([1,3,4,np.nan,6,8], index=dates).shift(3)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    NaN
2013-01-04    1.0
2013-01-05    3.0
2013-01-06    4.0
Freq: D, dtype: float64

In [42]:
df['A'].sub(s,axis='index') #subtract

2013-01-01         NaN
2013-01-02         NaN
2013-01-03         NaN
2013-01-04   -3.239197
2013-01-05   -3.285067
2013-01-06   -3.443724
Freq: D, dtype: float64

In [45]:
df.apply(np.cumsum)

                   A         B         C   D   E
2013-01-01 -0.920986  1.293260 -2.117696   5   0
2013-01-02 -1.796637  2.678992 -2.435954  10   1
2013-01-03 -2.110269  1.150013 -4.638157  15   3
2013-01-04 -4.349467  0.857611 -4.845680  20   6
2013-01-05 -4.634533  0.652580 -5.066814  25  10
2013-01-06 -4.078257  2.614994 -4.734828  30  15

In [46]:
?np.cumsum

In [53]:
df['F']=(np.arange(len(df)))

In [56]:
df.loc[dates[0]:dates[2],'F']=np.nan

In [59]:
df.apply(np.cumsum)

                   A         B         C   D   E     F
2013-01-01 -0.920986  1.293260 -2.117696   5   0   NaN
2013-01-02 -1.796637  2.678992 -2.435954  10   1   NaN
2013-01-03 -2.110269  1.150013 -4.638157  15   3   NaN
2013-01-04 -4.349467  0.857611 -4.845680  20   6   3.0
2013-01-05 -4.634533  0.652580 -5.066814  25  10   7.0
2013-01-06 -4.078257  2.614994 -4.734828  30  15  12.0

In [60]:
df.apply(lambda x: x.max() - x.min())

A    2.795473
B    3.491393
C    2.534188
D    0.000000
E    5.000000
F    2.000000
dtype: float64

In [62]:
s=pd.Series(np.random.randint(0,7,size=10))
s

0    2
1    4
2    1
3    6
4    3
5    2
6    5
7    3
8    0
9    4
dtype: int64

In [65]:
s.value_counts()

4    2
3    2
2    2
6    1
5    1
1    1
0    1
dtype: int64

In [73]:
s=pd.Series(['A','B','C','abba','BaCa','cotesDuJura',np.nan])

In [74]:
s.str.lower()

0              a
1              b
2              c
3           abba
4           baca
5    cotesdujura
6            NaN
dtype: object

In [75]:
s.str.capitalize()

0              A
1              B
2              C
3           Abba
4           Baca
5    Cotesdujura
6            NaN
dtype: object

In [76]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  1.200281  0.083709  0.539675  0.471388
1 -1.275903 -0.523052  1.419055  0.899055
2 -1.548110  0.177022 -0.686098 -1.364721
3  1.400987  1.440825 -0.131800 -0.937243
4  0.587103 -0.468252 -2.477171  1.182887
5  0.162203 -1.262890  0.058952  0.262242
6  0.746485  1.925926 -0.963089 -0.433149
7 -0.355254 -0.752640  0.050126 -1.666559
8 -0.905747 -1.671687 -0.439285  1.096940
9 -1.454323  0.218593  0.576308 -1.027430

In [77]:
pieces = [df[:3],df[3:7],df[7:]]

In [78]:
pd.concat(pieces)

          0         1         2         3
0  1.200281  0.083709  0.539675  0.471388
1 -1.275903 -0.523052  1.419055  0.899055
2 -1.548110  0.177022 -0.686098 -1.364721
3  1.400987  1.440825 -0.131800 -0.937243
4  0.587103 -0.468252 -2.477171  1.182887
5  0.162203 -1.262890  0.058952  0.262242
6  0.746485  1.925926 -0.963089 -0.433149
7 -0.355254 -0.752640  0.050126 -1.666559
8 -0.905747 -1.671687 -0.439285  1.096940
9 -1.454323  0.218593  0.576308 -1.027430

In [95]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','bar'], 'rval':[4,5]})

In [96]:
left

   key  lval
0  foo     1
1  bar     2

In [97]:
right

   key  rval
0  foo     4
1  bar     5

In [98]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [99]:
left.merge(right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5